Tekla.Structures.Internal.IAsyncCallCompletion`1
Remoting helper to pass asynchronous calls.
The result type. Must be serializable.

Tekla.Structures.Internal.IAsyncCallCompletion`1.OnCompleted(`0)
Successful completion handler.
result: The resulting data.